export const TEXTS = {
	INPUT_DEVICE_ID: '请输入设备ID',
	INVALID_DEVICE_ID: '请输入合法设备ID',
	DEVICE_ID_EXISTS: '设备ID已存在',
	NO_SIGNAL: '暂无信号',
	FAIL_TO_CONNECT_SERIAL: '串口连接失败，已撤销设备创建',
	DEVICE: '设备',
	CONNECT_DEVICE: '连接设备',
	PAUSE_DATA_STREAM: '暂停数据',
	LETGO_DATA_STREAM: '放行数据',
	DATABASE_TO_TABLE: '数据转表',
	DEVICE_LIST: '设备列表',
	CURRENTLY_NO_DEVICE: '当前暂无设备',
	TITLE: 'EEG数据采集系统',
	SLOGANS: [
		'欢迎使用EEG数据采集系统, 请阅读下方操作步骤.',
		'为确保设备和接收器一一对应, 请给它们贴好数字标签.',
		'数据库保存于App启动目录下的database.sqlite.',
		'鼠标悬停于图表右上角二维码图标时, 可以唤出二维码供受试人员扫描.',
		'受试人员扫描自己设备对应的二维码可进入专注/放松度预览视图.',
		'和本机处于同一Wi-Fi局域网下, 受试人员才能正确看到预览界面.',
		'鼠标点击设备列表项, 可以快速切换到对应的实时数据图表.',
		'数据放行过程中, 您无法连接设备.',
		'看到侧边栏下方一排工具按钮了吗? 它们可以快速开关想观察的频道.',
		'数据收集过程中, 不应该随意插拔接收器.',
		'如果想查看数据快照, 您应该Win+Shift+S截图, 而不是截停数据流.',
		'数据库的保存是自动的, 请不要关闭后端服务终端进程.'
	],
	STEPS: [
		'受试人员领取EEG设备进行佩戴，做好其设备编号的登记，然后将对应编号的接收器接入本机。',
		'接收器介入就绪后，点击左侧「连接设备」，输入接收器编号，选择其接入的串口即可接收数据。',
		'点击左侧「放行数据」即可把接收到的数据传输到本地Sqlite数据库，并实时渲染收集到的数据图表。'
	],
	PLEASE_CHECK_CSV: 'CSV表格已导出，请查看软件目录文件夹。',
	EXCEPTON_BACKEND_CRUSH: '后端服务崩溃，请关闭app和服务终端窗口，重新启动start.bat，一切将恢复正常。本异常可能由第一次打开app或删除数据库引起，无需担心。'
}
